#5.2[28]: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1. Циклы использовать нельзя
#Примеры/Тесты:
#<function_name>(0,0) -> 0
#<function_name>(0,2) -> 2
#<function_name>(3,0) -> 3
def sum (a, b):
    summ = a
    if b == 0:
        return summ
    else:
        return sum (a + 1, b - 1)
        
number1 = int (input ('Введите первое число для сложения: '))
number2 = int (input ('Введите второе число для сложения: '))
print (f'Сумма чисел {number1} и {number2} равна {sum (number1, number2)}')